In [1]:
import pandas as pd
import numpy as np

#### __1. Extract year, month, and day from a datetime column and create separate columns for each component.__

In [105]:
df = pd.DataFrame(pd.date_range(start="2025-09-27", periods=10), columns=["Dates"])
df[["Year", "Month", "Day"]] = df["Dates"].apply(lambda x: pd.Series([x.year, x.month, x.day]))
df

0    2025
1    2025
2    2025
3    2025
4    2025
5    2025
6    2025
7    2025
8    2025
9    2025
Name: Dates, dtype: int32

In [102]:
pd.Series(df["Dates"].dt.day)

0    27
1    28
2    29
3    30
4     1
5     2
6     3
7     4
8     5
9     6
Name: Dates, dtype: int32

#### __2. Filter rows of a DataFrame using .loc based on a condition (e.g., column value greater than a threshold).__

In [53]:
df2 = pd.DataFrame(np.random.randint(1,30, [6,4]), columns=list("ABCD"))
df2.loc[::2, ["A","C"]] = np.nan
print(df2)
df2.dropna(axis=1, thresh=6-2)

      A   B     C   D
0   NaN  22   NaN  12
1   5.0  24  27.0  28
2   NaN   4   NaN  23
3  18.0  27   9.0   7
4   NaN  28   NaN  21
5  25.0   3  13.0   4

    B   D
0  22  12
1  24  28
2   4  23
3  27   7
4  28  21
5   3   4

#### __3. Replace NaN values in a DataFrame with the mean of their respective columns.__

In [76]:
df3 = df2.copy()
print(f"{df3}\n\nFilling Missing Values by mean")
df3.A.fillna(df3["A"].mean()), df3.C.fillna(df3["C"].mean()).round(decimals=2)

      A   B     C   D
0   NaN  22   NaN  12
1   5.0  24  27.0  28
2   NaN   4   NaN  23
3  18.0  27   9.0   7
4   NaN  28   NaN  21
5  25.0   3  13.0   4

Filling Missing Values by mean

(0    16.0
 1     5.0
 2    16.0
 3    18.0
 4    16.0
 5    25.0
 Name: A, dtype: float64,
 0    16.33
 1    27.00
 2    16.33
 3     9.00
 4    16.33
 5    13.00
 Name: C, dtype: float64)

#### __4. Describe different ways of creating DataFrames in Pandas. Provide examples.__

In [94]:
# Way-1
pd.DataFrame(np.random.sample([2,4]), columns=list("ABCD"))

          A         B         C         D
0  0.682055  0.472074  0.542726  0.252098
1  0.025070  0.825779  0.792518  0.779465

In [96]:
# Way-2
pd.read_csv("../exercises/data/first5.csv")

   Unnamed: 0   age  gender     bmi  children smoker     region      charges
0           0   NaN  female  27.900         0    yes  southwest  16884.92400
1           1  18.0    male  33.770         1     no  southeast   1725.55230
2           2   NaN    male  33.000         3     no  southeast   4449.46200
3           3  33.0    male  22.705         0     no  northwest  21984.47061
4           4   NaN    male  28.880         0     no  northwest   3866.85520

#### __5. Explain the differences between .loc and .iloc for indexing in Pandas. Provide examples.__

| `.loc` (label-based)                                                                                                                   | `.iloc` (integer-position-based)                                                                                                                            |
| ---------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| Uses row and column labels (e.g.,`'a'`, `'Name'`). If your index is numeric, it still treats these numbers as labels, not positions. | Uses integer positions for both rows and columns (e.g.,`0`, `1`, `2`).                                                                                  |
| **Inclusive** of the stop label. `df.loc['a':'c']` selects rows with labels `'a'`, `'b'`, and `'c'`.                       | **Exclusive** of the stop position, just like standard Python list slicing. `df.iloc[0:3]` selects rows at integer positions `0`, `1`, and `2`. |
| Raises a `KeyError` if a requested label does not exist.                                                                               | Raises an `IndexError` if a requested integer position is out of bounds.                                                                                    |
| Supports boolean arrays directly to filter data based on conditions (e.g.,`df.loc[df['Age'] > 30]`).                                   | Supports boolean arrays, but the array must be aligned with the row or column positions.                                                                      |
| Use when you know the exact names of the rows and columns you want to select.                                                            | Use when you know the integer position of the data, which is useful for programmatic access or when the DataFrame index is not meaningful                     |

#### __10. Aggregate DataFrame data using custom operations for different columns using the aggregate function.__

In [54]:
df = pd.read_csv("../exercises/data/Emp_data.csv")

In [55]:
df.aggregate({'Salary' : ['sum', 'max', 'mean'], 'Weight in Kgs': ['sum', 'max', 'mean'] })

           Salary  Weight in Kgs
sum   11973809.00        5808.00
max     197537.00          90.00
mean    119738.09          58.08

#### __11. Use the apply function to categorize numeric column values into bins such as 'Low', 'Medium', and 'High'.__

In [22]:
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [163]:
df.insert(4, 'Weight_category', df['Weight in Kgs'].apply(lambda x: np.where(x >= 80, 'High', np.where(x > 50, "Medium", "Low"))))
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Weight_category,Age in Company,Salary,City
0,677509,Lois,36.36,60,Medium,13.68,168251,Denver
1,940761,Brenda,47.02,60,Medium,9.01,51063,Stonewall
2,428945,Joe,54.15,68,Medium,0.98,50155,Michigantown
3,408351,Diane,39.67,51,Medium,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,Medium,4.01,117642,Fremont

#### __16. Student Performance Analysis: Create a DataFrame with columns: StudentID, StudentName, Math, Science, English (minimum 5 entries).__

- a. Identify the student with the highest average score and display their name and average score.
- b. Calculate the average Math score and list students scoring above this average.
- c. Determine which subject had the highest overall average score.

In [171]:
col = ["StudentID", "StudentName", "Math", "Science", "English"]

df = pd.DataFrame(columns=col)
df.StudentID = range(1,6)
df.StudentName = ["test1", "test2", "test3", "test4", "test5"]
df.Math = np.random.randint(35,95, 5)
df.Science = np.random.randint(35,78, 5)
df.English = np.random.randint(35,70, 5)

In [172]:
df

   StudentID StudentName  Math  Science  English
0          1       test1    86       72       69
1          2       test2    62       75       42
2          3       test3    88       73       41
3          4       test4    49       65       44
4          5       test5    67       43       63

__a. Identify the student with the highest average score and display their name and average score.__

In [173]:
df["average"] = df[["Math","Science", "English"]].mean(axis=1).round(decimals=2)
df

   StudentID StudentName  Math  Science  English  average
0          1       test1    86       72       69    75.67
1          2       test2    62       75       42    59.67
2          3       test3    88       73       41    67.33
3          4       test4    49       65       44    52.67
4          5       test5    67       43       63    57.67

In [118]:
df[df.average == df.average.max()][["StudentName", "average"]]

  StudentName  average
0       test1    75.67

__b. Calculate the average Math score and list students scoring above this__

In [135]:
np.where(df["Math"]>df.Math.mean(), df.StudentName, df.Math)

array(['test1', 62, 'test3', 49, 67], dtype=object)

__c. Determine which subject had the highest overall average score.__

In [174]:
if df['Math'].mean() > df['Science'].mean() and df['Math'].mean() > df['English'].mean():
    print("Math")
elif df['Science'].mean() > df['Math'].mean() and df['Science'].mean() > df['English'].mean():
    print("Science")
else:
    print("english")

Math